In [6]:
import pandas as pd
import numpy as np

In [7]:
ela_0612_csv = "2006-2012-english-language-arts-ela-test-results-charter-schools.csv"
ela_1317_csv = "2013-2017-charter-school-ela-results-all-1.csv"
eladf_0612 = pd.read_csv(ela_0612_csv)
eladf_1317 = pd.read_csv(ela_1317_csv)

In [8]:
eladf_1317.head()

,DBN,School Name,Grade,Year,Category,Number Tested,Mean Scale Score,Level1_N,Level1_%,Level2_N,Level2_%,Level3_N,Level3_%,Level4_N,Level4_%,Level3+4_N,Level3+4_%
0,84K037,BEGINNING WITH CHILDREN CHARTER SCHOOL II,3,2015,All Students,43,306,9,20.9,20,46.5,13,30.2,1,2.3,14,32.6
1,84K037,BEGINNING WITH CHILDREN CHARTER SCHOOL II,3,2016,All Students,52,319,4,7.7,20,38.5,25,48.1,3,5.8,28,53.8
2,84K037,BEGINNING WITH CHILDREN CHARTER SCHOOL II,3,2017,All Students,50,323,2,4.0,16,32.0,29,58.0,3,6.0,32,64.0
3,84K037,BEGINNING WITH CHILDREN CHARTER SCHOOL II,4,2016,All Students,40,315,4,10.0,18,45.0,14,35.0,4,10.0,18,45.0
4,84K037,BEGINNING WITH CHILDREN CHARTER SCHOOL II,4,2017,All Students,52,320,4,7.7,18,34.6,21,40.4,9,17.3,30,57.7

In [9]:
eladf_1317 = eladf_1317[eladf_1317.Grade != 'All Grades']
eladf_0612 = eladf_0612[eladf_0612.Grade != 'All Grades']

In [10]:
eladf_1317 = eladf_1317[eladf_1317.Grade == '3']
eladf_0612 = eladf_0612[eladf_0612.Grade == '3']

In [11]:
ela_cols = ['DBN','Grade','Year','Number Tested','Mean Scale Score']
eladf_1317 = eladf_1317[ela_cols]
eladf_0612 = eladf_0612[ela_cols]

In [12]:
eladf_1317.head()

       DBN Grade  Year  Number Tested Mean Scale Score
0   84K037     3  2015             43              306
1   84K037     3  2016             52              319
2   84K037     3  2017             50              323
9   84K125     3  2015             56              322
10  84K125     3  2016             78              340

In [13]:
eladf_1317 = eladf_1317.groupby('DBN')
eladf_0612 = eladf_0612.groupby('DBN')
eladf_1317.first()

       Grade  Year  Number Tested Mean Scale Score
DBN
84K037     3  2015             43              306
84K125     3  2015             56              322
84K129     3  2015             73              341
84K182     3  2015             76              334
84K333     3  2013             57              296
...      ...   ...            ...              ...
84X705     3  2013             52              287
84X706     3  2013             74              303
84X717     3  2013             34              314
84X718     3  2013             63              305
84X730     3  2013             52              299

[145 rows x 4 columns]

In [14]:
eladf_0612.first()

       Grade  Year  Number Tested Mean Scale Score
DBN
84K356     3  2008             85              682
84K358     3  2008             74              669
84K359     3  2008             60              671
84K362     3  2006             18              660
84K379     3  2012             59              659
...      ...   ...            ...              ...
84X705     3  2006             34              646
84X706     3  2006             40              634
84X717     3  2006             36              676
84X718     3  2006             53              666
84X730     3  2006             40              642

[74 rows x 4 columns]